# WEEK 8

This deals with the concat dataframe

In [9]:
import pandas as pd

India_weather=pd.DataFrame({
    'City' : ['Chennai','Banglore','Delhi'],
    'Temperature':['23','34','34'],
    'Humidity':['12','11','23']
})

US_weather=pd.DataFrame({
    'City':['Dallas','New York','California'],
    'Temperature':['32','23','22'],
    'Humidity':['23','22','14']
})

conc=pd.concat([India_weather,US_weather])
#conc.set_index('City',inplace=True)
conc

         City Temperature Humidity
0     Chennai          23       12
1    Banglore          34       11
2       Delhi          34       23
0      Dallas          32       23
1    New York          23       22
2  California          22       14

Look at the above the index , as things are concatenated

## How do you go about reseting the index?

In [11]:
conc.set_index('City',inplace=True)
conc

           Temperature Humidity
City
Chennai             23       12
Banglore            34       11
Delhi               34       23
Dallas              32       23
New York            23       22
California          22       14

In [13]:
conc.reset_index(inplace=True)
conc

         City Temperature Humidity
0     Chennai          23       12
1    Banglore          34       11
2       Delhi          34       23
3      Dallas          32       23
4    New York          23       22
5  California          22       14

However if you want to take care of index at the concat itself, how you can go about it ?

In [14]:
new_conc=pd.concat([India_weather,US_weather],ignore_index=True)
new_conc

         City Temperature Humidity
0     Chennai          23       12
1    Banglore          34       11
2       Delhi          34       23
3      Dallas          32       23
4    New York          23       22
5  California          22       14

If you want to know more arguments that the concat function can take, visit the documentation

# What is module ?

Pandas is a library, module in pandas ,core module that handles DataFrame is a file written in a language , here python , that can define functions, classes and variables

# Deep Learning of the fundementals

Argument is a value that is passed to a function or method 
pd.concat(df1,df2,axis=0)
here df1 df2 axis=0 are arguments 

Call:A call is the act of invoking a function or method. When you call a function or method, you execute the code within it.

DataFrame is a tabular data structure in pandas,tabular data structure with labeled axes (rows and columns), it is an object in the pandas library core module.

libraray is a collection of modules , whereras module is a sinlge file containing python code (functions,classes,variables)

methods are functions that you can call on these objects to perform operations.
Think of a method as a special function that belongs to an object (like a DataFrame). You use methods to do things with the object.

Yes, you can say that DataFrames are objects in the core module of the pandas library, and methods like set_index can be performed on them. Here is a refined version of your notes with that clarification:

Key Modules in the Pandas Library
panads.core ( whic includes primary Data structures (data frame,series))
pandas.io ( )

Methods on Objects: Methods like to_csv() are called on DataFrame objects because they operate on the data within the DataFrame.
df.to_csv('data.csv', index=False)

Functions in the pandas Namespace: Functions like read_csv() are called using the pd namespace because they are general functions that create or manipulate DataFrame objects.
df_from_csv = pd.read_csv('data.csv')

Class: DataFrame is a class in the pandas.core.frame submodule. It defines the structure and behavior of DataFrame objects.
Object: df is an object (instance) of the DataFrame class. It is created using the pd.DataFrame(data) constructor.

pandas is library
pandas.core is the module
pandas.core.fram is the sub-module

pd.read_csv() is a function in the pandas
df.to_csv() is is a methods on object df

## coming back to the week 8

Different types of arguments used in the concat function

## What does key argument in concat does?

It creates additional index

In [16]:
conc

         City Temperature Humidity
0     Chennai          23       12
1    Banglore          34       11
2       Delhi          34       23
3      Dallas          32       23
4    New York          23       22
5  California          22       14

In [30]:
conc1 = pd.concat([US_weather, India_weather], keys=['US', 'India'])
conc1

               City Temperature Humidity
US    0      Dallas          32       23
      1    New York          23       22
      2  California          22       14
India 0     Chennai          23       12
      1    Banglore          34       11
      2       Delhi          34       23

Note : The us weather are not columns it is a dictionary , hence no need to quote it.

Without Quotes (US_weather): Interpreted as a variable name.

With Quotes ('US_weather'): Interpreted as a string literal.

## How keys can be used ?

In [32]:
conc1.loc['India']

       City Temperature Humidity
0   Chennai          23       12
1  Banglore          34       11
2     Delhi          34       23

We can use methods such as loc to pick the exact part of the dataframe object.

## How do you append into the dataframes as columns than as rows ?

Thats where the axis argument comes handy in the concat function

In [36]:
dict1={
    "city":["mumbai","chennai"],
    "windspeed":["23","22"]
}
dict2={
    "city":["mumbai","chennai"],
    "weather":["23","22"]
}

dataframe1=pd.DataFrame(dict1)
dataframe2=pd.DataFrame(dict2)

c=pd.concat([dataframe1,dataframe2])
c

      city windspeed weather
0   mumbai        23     NaN
1  chennai        22     NaN
0   mumbai       NaN      23
1  chennai       NaN      22

In [ ]:
dict1={
    "city":["mumbai","chennai"],
    "windspeed":["23","22"]
}
dict2={
    "city":["mumbai","chennai"],
    "weather":["23","22"]
}

dataframe1=pd.DataFrame(dict1)
dataframe2=pd.DataFrame(dict2)

c=pd.concat([dataframe1,dataframe2],axis=1,)
c

      city windspeed     city weather
0   mumbai        23   mumbai      23
1  chennai        22  chennai      22

## How do you merge same columns ?

Merge is the best way in that case, however will be dealt next week tutorials

## Adding a column to a existing dataframe using series

In [43]:
s=pd.Series(["humid","dry"],name='event')
s

0    humid
1      dry
Name: event, dtype: object

In [45]:
k=pd.concat([dataframe1,s],axis=1)
k

      city windspeed  event
0   mumbai        23  humid
1  chennai        22    dry